# Задача №1: Напишите программу, удаляющую из текста все слова, содержащие "абв".
# Пример:
# Входные данные: 'ываабвавб лепотабв это абвцукен абвабвгкруто ываы круто'


# txt = input("Введите текст через пробел:\n")
# print(f"Исходный текст: {txt}")
# find_txt = "абв"
# lst = [i for i in txt.split() if find_txt not in i]
# print(f'Результат: {" ".join(lst)}')

######### с использованием filter (просто для сравнения)

# txt = input("Введите текст через пробел:\n")
# print(f"Исходный текст: {txt}")
# lst = list(filter(lambda x: 'абв' not in x, txt.split(' ')))
# print(f'Результат: {" ".join(lst)}')