# https://github.com/haimka71/pythonProject.git

# Задача 1: Вычислить число pi c заданной точностью d. Пример:
# при d = 0.001,π = 3.141             10^(-1)≤d≤10^(-10)

# from math import pi
#
# d =  int(input("Введите число для заданной точности числа Пи:\n"))
# print(f'число Пи с заданной точностью {d} равно {round(pi, d)}')

#########################################################################

# Задача №2: Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# натуральное число называется простым, если у него ровно два делителя — единица и само число
# num = int(input("Введите число: "))
# i = 2                               # первое простое число, 1 им не является (спорный момент)
# lst = []
# mult = num
# while i <= num:
#     if num % i == 0:
#         lst.append(i)
#         num //= i
#         i = 2
#     else:
#         i += 1
# print(f"Простые множители числа {mult} : {lst}")