# https://github.com/haimka71/pythonProject.git

# Задача 1: Вычислить число pi c заданной точностью d. Пример:
# при d = 0.001,π = 3.141             10^(-1)≤d≤10^(-10)

# from math import pi
#
# d =  int(input("Введите число для заданной точности числа Пи:\n"))
# print(f'число Пи с заданной точностью {d} равно {round(pi, d)}')

#########################################################################

# Задача №2: Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# натуральное число называется простым, если у него ровно два делителя — единица и само число
# num = int(input("Введите число: "))
# i = 2                               # первое простое число, 1 им не является (спорный момент)
# lst = []
# mult = num
# while i <= num:
#     if num % i == 0:
#         lst.append(i)
#         num //= i
#         i = 2
#     else:
#         i += 1
# print(f"Простые множители числа {mult} : {lst}")


#########################################################################

# Задача №3: Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

# lst = list(map(int, input(
#     "Введите числа через пробел:\n").split()))  # создаем список преобразованных в int элементов строчного типа
# print(f"Исходный список: {lst}")
# new_lst = []
# count = 0
# # [new_lst.append(i) for i in lst if i not in new_lst]
# for i in lst:
#     if lst.count(i) == 1:
#         new_lst.append(i)
#         i += 1
# print(f"Список из неповторяющихся элементов: {new_lst}")

