# Задача №12: Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.
# Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

# number = int(input("Введите число: "))
# d = {i: 3*i + 1 for i in range(1,number+1)}
# print(f"Итоговая последовательность: {d}")

######################################################

# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)


# N = int(input("Введите N для набора произведений чисел от 1 до N: "))
# lst = [1]
# for i in range(2, N+1):
#     lst.append(lst[i-2] * i)
# print(f"Итоговый набор {lst}")

#########################################################

# Задайте список из n чисел последовательности (1+ (1/n))^n и выведите на экран их сумму.

# n = int(input("Введите число n: "))
# s = 0

# 1st variant #######

# for i in range(1,n+1):
#     s += (1+1/i)**i
# print(f"Полученная сумма последовательности (1+1/n)^n равна {round(s,2)}")  # с округлением до 2х цифр

# # update #########

# lst = [(1+1/i)**i for i in range(1,n+1)]
# print(f"Полученная сумма последовательности (1+1/n)^n равна {round(sum(lst),2)}")    # с округлением до 2х цифр

##############################################################


# Задача №17: Задать список из N элементов, заполненных числами из [-N, N].
# Найти произведение элементов на указанных позициях.
# Позиции хранятся в файле file.txt в одной строке одно число
#
# import random
#
#
# def write_file(number):
#     with open('file.txt', 'w') as data:
#         for i in range(number):
#             data.write = (f"{random.randrange(0, 2 * number)}\n")
#
#
#
# def read_file():
#     with open('file.txt', 'r') as data:
#         indexes = list(map(int, data.readlines()))
#     return indexes
#
#
# n = int(input("Введите число N: "))
# lst_number = [i for i in range(-n, n + 1)]
# write_file(n)
# lst_index = read_file()
# result = 1
# for i in range(len(lst_index)):
#     result *= lst_number[lst_index[i]]
# print(f"Результат равен = {result}")
